tutorials/fluidSolidInteraction/perpendicularFlap/constant/fluid/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh dynamicMotionSolverFvMesh;

"solver|motionSolver" velocityLaplacian; // finite volume solver
//"solver|motionSolver" laplace; // finite element solver
//"solver|motionSolver" RBFMeshMotionSolver; // radial basis function solver

diffusivity quadratic inverseDistance (interface);

// Settings for the RBF solver
// staticPatches    (top bottom left);
// movingPatches    (interface);
// fixedPatches     (inlet outlet);
// interpolation
// {
//     function     TPS;
// }
// coarsening
// {
//     enabled      no;
// }

// ************************************************************************* //
